In [4]:
import numpy as np
import pandas as pd
import seaborn as sns

In [6]:
ti = sns.load_dataset('titanic').loc[:, ['survived', 'sex', 'class']]

In [8]:
ti

     survived     sex   class
0           0    male   Third
1           1  female   First
2           1  female   Third
3           1  female   First
4           0    male   Third
..        ...     ...     ...
886         0    male  Second
887         1  female   First
888         0  female   Third
889         1    male   First
890         0    male   Third

[891 rows x 3 columns]

In [10]:
tc = sns.load_dataset('titanic')[['survived', 'sex', 'class']]

In [12]:
tc

     survived     sex   class
0           0    male   Third
1           1  female   First
2           1  female   Third
3           1  female   First
4           0    male   Third
..        ...     ...     ...
886         0    male  Second
887         1  female   First
888         0  female   Third
889         1    male   First
890         0    male   Third

[891 rows x 3 columns]

In [14]:
ti.shape

(891, 3)

In [16]:
ti.survived.mean()

0.3838383838383838

In [20]:
ti[ti['class']=='First']

     survived     sex  class
1           1  female  First
3           1  female  First
6           0    male  First
11          1  female  First
23          1    male  First
..        ...     ...    ...
871         1  female  First
872         0    male  First
879         1  female  First
887         1  female  First
889         1    male  First

[216 rows x 3 columns]

In [24]:
ti[ti['class']=='First'].survived.mean()

0.6296296296296297

In [38]:
ti.groupby('class')

/tmp/ipykernel_231665/1200795981.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  ti.groupby('class')